fishinginaswamp/duelibs/SAM3XDUE/SAM3XDUE.H
#pragma once
#ifndef _SAM3X8E_
extern "C" {
#include <sam3x8e.h>
}
#endif

//***THIS IS FOR PIN STUFF***//
#ifndef SAM3XDUE
#define SAM3XDUE

inline void operator delete(void* ptr, unsigned int size) noexcept {
	::operator delete(ptr);
}

inline void operator delete[](void* ptr, unsigned int size) noexcept {
	::operator delete[](ptr);
}

extern "C" uint32_t pmc_enable_periph_clk(uint32_t);
extern "C" uint32_t pmc_disable_periph_clk(uint32_t);

//***PIN DEFINITIONS***//
// The letter at the end of the definition name is the port the pin is on, as a reminder
//Analog pins
#define PIN_A0A (1<<16)		//PA16
#define PIN_A1A (1<<24)		//PA24	
#define PIN_A2A (1<<23)		//PA23
#define PIN_A3A (1<<22)		//PA22
#define PIN_A4A (1<<6)		//PA6
#define PIN_A5A (1<<4)		//PA4
#define PIN_A6A (1<<3)		//PA3
#define PIN_A7A (1<<2)		//PA2
#define PIN_A8B (1<<17)		//PB17
#define PIN_A9B (1<<18)		//PB18
#define PIN_A10B (1<<19)	//PB19
#define PIN_A11B (1<<20)	//PB20
//Digital pins
#define PIN_1A (1<<9)		//PA9, Arduino TX0 -- UTXD periph. A
#define PIN_0A (1<<8)		//PA8, Arduino RX0 -- PWM periph. B -- URXD periph. A
#define PIN_2B (1<<25)		//PB25, TIOA periph mode B
#define PIN_3C (1<<28)		//PC28
#define PIN_4A (1<<29)		//PA29
#define PIN_5C (1<<25)		//PC25
#define PIN_6C (1<<24)		//PC24
#define PIN_7C (1<<23)		//PC23
#define PIN_8C (1<<22)		//PC22
#define PIN_9C (1<<21)		//PC21
#define PIN_10A (1<<28)		//PA28 - SPI0_NPCS0 (Periph. mode A)
#define PIN_11D (1<<7)		//PD7
#define PIN_12D (1<<8)		//PD8
#define PIN_13B (1<<27)		//PB27, built in LED
#define PIN_14D (1<<4)		//PD4, also TX3
#define PIN_15D (1<<5)		//PD5, also RX3
#define PIN_16A (1<<13)		//PA13, also TX1
#define PIN_17A (1<<12)		//PA12, also RX1
#define PIN_18A (1<<11)		//PA11, also TX0 (Periph. mode A)
#define PIN_19A (1<<10)		//PA10, also RX0 (Periph. mode A)
#define PIN_20B (1<<12)		//PB12, also SDA (near the bank of digital pins)
#define PIN_21B (1<<13)		//PB13, also SCL (near the bank of digital pins)
//note: the SDA/SCL pin pairs (the top and bottom ones) seem to have the same function/digital mapping but different CPU connections
#define PIN_22B (1<<26)		//PB26
#define PIN_23A (1<<14)		//PA14
#define PIN_24A (1<<15)		//PA15
#define PIN_25D (1<<0)		//PD0
#define PIN_26D (1<<1)		//PD1
#define PIN_27D (1<<2)		//PD2
#define PIN_28D (1<<3)		//PD3
#define PIN_29D (1<<6)		//PD6
#define PIN_30D (1<<9)		//PD9
#define PIN_31A (1<<7)		//PA7
#define PIN_32D (1<<10)		//PD10
#define PIN_33C (1<<1)		//PC1
#define PIN_34C (1<<2)		//PC2
#define PIN_35C (1<<3)		//PC3
#define PIN_36C (1<<4)		//PC4
#define PIN_37C (1<<5)		//PC5
#define PIN_38C (1<<6)		//PC6
#define PIN_39C (1<<7)		//PC7
#define PIN_40C (1<<8)		//PC8
#define PIN_41C (1<<9)		//PC9
#define PIN_42A (1<<19)		//PA19
#define PIN_43A (1<<20)		//PA20
#define PIN_44C (1<<19)		//PC19
#define PIN_45C (1<<18)		//PC18
#define PIN_46C (1<<17)		//PC17
#define PIN_47C (1<<16)		//PC16
#define PIN_48C (1<<15)		//PC15
#define PIN_49C (1<<14)		//PC14
#define PIN_50C (1<<13)		//PC13
#define PIN_51C (1<<12)		//PC12
#define PIN_52B (1<<21)		//PB21
#define PIN_53B (1<<14)		//PB14

/*
********SPI HEADER PINS********

 Holding the Due flat, so power jack is on the top left, digital pins closest to you
 The SPI header is a 2x3 (2 rows 3 Cols)


 _______________________________
 (+)	       	(+)
  ^				 ^
 power			reset button

_____________
SAM3X8E (MCU)
______________

   5	3	 1
  (*)  (*)  (*)		SPI
  (*)  (*)  (*)
   6    4    2

 ___________
 DIGITAL PINS
 __________
 ______________________________


 NOTE: COPI == MOSI (Controller out, Peripheral in)
 NOTE: CIPO == MISO (Controller in, Peripheral out)
 PIN 1 - CIPO - SPI0_CIPO - PA25 Periph. mode A
 PIN 2 - 5V OUT, don't use this? (it's part of the main 5v rail)
 PIN 3 - SCK - SPI0_SCK - PA27 Peiph. mode A - WKUP[10]
 PIN 4 - COPI - SPI0_COPI - PA26 Periph. mode A
 PIN 5 - RESET - NRSTb
 PIN 6 - GND
*/

//All port A periph mode A
#define SPI0_MOSI (1<<26)
#define SPI0_MISO (1<<25)
#define SPI0_SCK (1<<27)
//there are npcs1/2/3 on some port B pins but i dont have those right now
//i think that'll take a little bit of work
#define SPI0_NPCS0 (1 << 28)
#define SPI0_NPCS1 (1 << 29)
#define SPI0_NPCS2 (1 << 30)
//#define SPI0_NPCS3 (1 << 31) not wired on the due
#define SPI0_NSS (1 << 28) //NPCS0 becomes NSS when set as input and Due is SPI0 slave
const uint8_t spi0_cs_portA_pins[4] = {28, 29, 30, 31}; //map cs number to pin bit


//Special pins
//Some of these don't have digital or analog pins??
#define DAC0B (1<<15)		//PB15
#define DAC1B (1<<16)		//PB16 - also PWML0
#define PWML0 DAC1B
#define CANRX0A (1<<1)		//PA1
#define CANTX0A (1<<0)		//PA0
#define SCL1A (1<<18)		//PA18, this is the SCL closest to reset button - also TWCLK
#define SDA1A (1<<17)		//PA17, this is the SDA closest to reset button - also TWD
#define TX0A PIN_1A			//PA9, also digital pin 1
#define RX0A PIN_0A			//PA8, also digital pin 0

//PWM pins
#define PWMH0 PIN_0A
#define PWMH1 

//UART pins
#define URXD PIN_0A
#define UTXD PIN_1A

//USART pins
#define TX0 PIN_18A
#define RX0 PIN_19A

//There are outputs for the RNG
inline uint32_t get_RNG() { return REG_TRNG_ODATA; }
inline void init_TRNG() {
	pmc_enable_periph_clk(ID_TRNG);
	REG_TRNG_CR = (0x524e47 << 8) | 1;
}
inline void disable_TRNG() { 
	REG_TRNG_CR = (0x524e47 << 8); 
	pmc_disable_periph_clk(ID_TRNG);
}

//New functions to replace the old ones
//Enable (or disable) peripheral I/O access
inline void pio_enable_pio(Pio* pio, uint32_t pins) { pio->PIO_PER |= pins; }
inline void pio_disable_pio(Pio* pio, uint32_t pins) { pio->PIO_PDR |= pins; }
//Enable (or disable) output to pins
inline void pio_enable_output(Pio* pio, uint32_t pins) { pio->PIO_OER |= pins; }
inline void pio_disable_output(Pio* pio, uint32_t pins) { pio->PIO_ODR |= pins; }
//Enable (or disable) pullup resistors on pin
inline void pio_enable_pullup(Pio* pio, uint32_t pins) { pio->PIO_PUER |= pins; }
inline void pio_disable_pullup(Pio* pio, uint32_t pins) { pio->PIO_PUDR |= pins; }
//Enable (or disable) writing to the PIO_ODSR register
inline void pio_enable_output_write(Pio* pio, uint32_t pins) { pio->PIO_OWER |= pins; }
inline void pio_disable_output_write(Pio* pio, uint32_t pins) { pio->PIO_OWDR |= pins; }
//Write pins HIGH or LOW (not at once) - does not use ODSR
inline void pio_output_write_HIGH(Pio* pio, uint32_t pins) { pio->PIO_SODR |= pins; }
inline void pio_output_write_LOW(Pio* pio, uint32_t pins) { pio->PIO_CODR |= pins; }
//Write to entire bank using PIO_ODSR
inline void pio_output_write(Pio* pio, uint32_t pins) { pio->PIO_ODSR = pins; }
//Read state of PIO register
inline uint32_t pio_read_port(Pio* pio) { return pio->PIO_PDSR; }
//Set peripheral mode
inline void pio_set_periph_mode_A(Pio* pio, uint32_t pins) { pio->PIO_ABSR &= ~pins; }
inline void pio_set_periph_mode_B(Pio* pio, uint32_t pins) { pio->PIO_ABSR |= pins; }

