fishinginaswamp/duelibs/SAM3XDUE/SAM3XDUE.H
//TRYING TO GET PWM TO WORK
//PWM info is on PDF page 970 in the datasheet
//The PWM clock must be enabled in the Power Management Controller (PWM) before using the PWM
//The PWM clock is the frequency of the master clock divided by a scaler
//Each channel has its own 16-bit counter (8 channels total)

static inline void delayMicros(uint32_t usec) {
	/*
	 * Based on Paul Stoffregen's implementation
	 * for Teensy 3.0 (http://www.pjrc.com/)
	 */
	if (usec == 0) return;
	uint32_t n = usec * (84000000 / 3000000);
	asm volatile(
		"L_%=_delayMicroseconds:"       "\n\t"
		"subs   %0, #1"                 "\n\t"
		"bne    L_%=_delayMicroseconds" "\n"
		: "+r" (n) :
		);
}

//PDF page 1003 has a list of the registers used for the PWM
//(might not be all, too tired to read at the moment of writing this)
//At least 4 registers per channel, 8 channels, lots of registers, this'll take a while

//Functions to Enable/disable PWM in the PWM status register, and read status
//This enables/disables output of the PWM on the channels
//PDF page 1007
inline void enable_pwm_ch0() { REG_PWM_ENA |= (1 << 0); }
inline void enable_pwm_ch1() { REG_PWM_ENA |= (1 << 1); }
inline void enable_pwm_ch2() { REG_PWM_ENA |= (1 << 2); }
inline void enable_pwm_ch3() { REG_PWM_ENA |= (1 << 3); }
inline void enable_pwm_ch4() { REG_PWM_ENA |= (1 << 4); }
inline void enable_pwm_ch5() { REG_PWM_ENA |= (1 << 5); }
inline void enable_pwm_ch6() { REG_PWM_ENA |= (1 << 6); }
inline void enable_pwm_ch7() { REG_PWM_ENA |= (1 << 7); }
inline void disable_pwm_ch0() { REG_PWM_DIS |= (1 << 0); }
inline void disable_pwm_ch1() { REG_PWM_DIS |= (1 << 1); }
inline void disable_pwm_ch2() { REG_PWM_DIS |= (1 << 2); }
inline void disable_pwm_ch3() { REG_PWM_DIS |= (1 << 3); }
inline void disable_pwm_ch4() { REG_PWM_DIS |= (1 << 4); }
inline void disable_pwm_ch5() { REG_PWM_DIS |= (1 << 5); }
inline void disable_pwm_ch6() { REG_PWM_DIS |= (1 << 6); }
inline void disable_pwm_ch7() { REG_PWM_DIS |= (1 << 7); }
inline void set_enable_pwm(uint32_t port) { REG_PWM_ENA = port; }
inline void set_disable_pwm(uint32_t port) { REG_PWM_DIS = port; }
inline uint32_t read_pwm_status() { return REG_PWM_SR; }

//PWM clock register
//Info on pdf page 1006
//DIVA/B in PWM_CLK register determines on/off and divider values
//DIVA/B = 0 - CLKA/B is OFF
//DIVA/B = 1 - CLKA/B determined by PREA/B
//DIVA/B = 2-255 - CLKA determined by PREA/B divided by DIVA/B
//These are read as "PWM prescaler = Masterclock / [factor]"
#define PWM_MCK_1 0b0000
#define PWM_MCK_2 0b0001
#define PWM_MCK_4 0b0010
#define PWM_MCK_8 0b0011
#define PWM_MCK_16 0b0100
#define PWM_MCK_32 0b0101
#define PWM_MCK_64 0b0110
#define PWM_MCK_128 0b0111
#define PWM_MCK_256 0b1000
#define PWM_MCK_512 0b1001
#define PWM_MCK_1024 0b1010
//These are used in the PWM_CMR (channel mode register)
#define PWM_CLKA 0b1011
#define PWM_CLKB 0b1100
//Anything other than these values are reserved
inline void set_pwm_prescalerA(uint8_t prescaler) {
	REG_PWM_CLK &= 0xFFFFF0FF;
	REG_PWM_CLK |= prescaler << 8;
}
inline void set_pwm_prescalerB(uint8_t prescaler) {
	REG_PWM_CLK &= 0xF0FFFFFF;
	REG_PWM_CLK |= prescaler << 24;
}
//div_factor needs to be >0 for clock to be turned ON
//Value needs to be 0-255
inline void set_pwm_div_factorA(uint8_t div_factor) {
	REG_PWM_CLK &= 0xFFFFFF00;
	REG_PWM_CLK |= div_factor;
}
inline void set_pwm_div_factorB(uint8_t div_factor) {
	REG_PWM_CLK &= 0xFF00FFFF;
	REG_PWM_CLK |= div_factor << 16;
}
//These set DIVA/B in the PWM_CLK register to 0
inline void stop_pwm_clkA() { REG_PWM_CLK &= 0xFF00FFFF; }
inline void stop_pwm_clkB() { REG_PWM_CLK &= 0xFFFFFF00; }

//Comparison values info is on pdf page 1041
inline void enable_comp_match_A() { REG_PWM_CMPM0 |= 1; }

//This is on PDF page 1044
inline void pwm_ch2_mode(uint32_t port) {
	REG_PWM_CMR2 = port;
}
//There are update registers as well, that act as buffers
//This is like the upper value, when the counter resets
//PDF page 1048
inline void pwm_ch2_period(uint8_t period) {
	REG_PWM_CPRD2 = period;
}
//This is like the compare match value
//PDF page 1046
inline void pwm_ch2_duty_cycle(uint8_t duty) {
	REG_PWM_CDTY2 = duty;
}

//PWM interrupts
//PDF page 1019
inline void pwm_ier2(uint32_t port) {
	REG_PWM_IER2 = port;
}
inline void pwm_idr2(uint32_t port) {
	REG_PWM_IDR2 = port;
}


/*
UART functions
Starts on page 750 of the datasheet PDF
*/

//Enables RX and TX
inline void uart_enable_rx_tx() { REG_UART_CR |= (1 << 6) | (1 << 4); }
inline void uart_enable_rx() { REG_UART_CR |= (1 << 4); }
inline void uart_disable_rx() { REG_UART_CR &= ~(1 << 5); }
//Baud rate = MCK/(16*CD)
inline void uart_set_clk_div(uint16_t div) { REG_UART_BRGR = div; }


//Different settings for the parity bit
#define DUE_UART_EVEN_PARITY 0
#define DUE_UART_ODD_PARITY 1
#define DUE_UART_SPACE_PARITY 2
#define DUE_UART_MARK_PARITY 3
#define DUE_UART_NO_PARITY 4

//Different settings for the channel mode, specifically for testing
#define DUE_UART_NORMAL 0			//UART runs normally
#define DUE_UART_AUTO 1				//UART auto triggers
#define DUE_UART_LOCAL_LOOPBACK 2	//look it up
#define DUE_UART_REMOTE_LOOPBACK 3	//look it up
inline void uart_set_parity_ch_mode(uint8_t ch_mode = DUE_UART_NORMAL, uint8_t parity = DUE_UART_NO_PARITY) {
	REG_UART_MR = 0;
	REG_UART_MR |= (parity << 9) | (ch_mode << 14);
}

inline uint32_t uart_read_rx() { return REG_UART_RHR; }
inline void uart_write_tx(uint8_t tx_data) { REG_UART_THR = tx_data; }



/*
TWI using SDA and SCL closest to the reset button
TWD0 - TWI data0 PA17   --- periph A
TWCK0 - TWI clock0 PA18   --- periph A
//Note: the arduino calls them "SDA1" and "SCLK1" even though they are "0"
*/


inline void twi0_set_device_addr(uint8_t addr) {
	REG_TWI0_MMR &= ~(0b1111111 << 16);
	REG_TWI0_MMR |= addr << 16;
}

inline void twi0_setup(uint8_t slave_addr) {
	pio_disable_pullup(PIOA, SDA1A | SCL1A);
	pio_enable_output(PIOA, SDA1A | SCL1A);
	pio_set_periph_mode_A(PIOA, SDA1A | SCL1A);
	pio_disable_pio(PIOA, SDA1A | SCL1A);
	twi0_set_device_addr(slave_addr);
	REG_TWI0_CR = (1 << 2) | (1 << 5);
	REG_TWI0_CWGR = 68 | (30 << 8) | (1 << 16);
}

