fishinginaswamp/duelibs/SAM3XDUE/SAM3XDUE.H
//0 - write, 1 - read
inline void twi0_mread(uint8_t mread) {
	REG_TWI0_MMR &= ~(1 << 12);
	REG_TWI0_MMR |= (mread << 12);
}


/*********/
//External memory bus
/*
I can really only use 8 bits because... arduino
D0-D7 - Pins 34-41 ALL PERIPH MODE A
THE PINOUT DIAGRAM SAYS 33-40 - THIS IS INCORRECT (It has been fixed in the new version don't worry)
The pinout diagram on the Arduino website is incorrect, follow the datasheet
NWE - Write enable Pin 45
NRD - Output (read) enable
NCS[x] - Chip select
NCS0 - Analog pin 4 PA6 - periph mode B

NWE goes to the lcd's WR pin (this is arduino pin 45)
NCS0 goes to the lcd's RS pin (this is PA6 which is analog pin 4)
*/

//Set the RS (D/CX) pin LOW to send command
//Set the RS (D/CX) pin HIGH to send data
//Commands for the TFT
//#define fuckarduino
#ifdef fuckarduino
const uint32_t col_addr_set = 0x2A;
const uint32_t page_addr_set = 0x2B;
const uint32_t mem_write = 0x2C;
const uint32_t set_brightness_cmd = 0x51;
uint8_t* const data = (uint8_t*)0x61000000;	//sets NCS0 HIGH for data
uint8_t* const command = (uint8_t*)0x60000000; //sets NCS0 LOW for cmd
const uint16_t tft_debug_newline_height = 311;	//amount of rows to scroll for a new line when debugging
uint16_t tft_vscroll_val = 0;
char tft_debug_buff[17];
bool two_byte_per_pix_mode = false;


uint32_t spi0_rx_buffer;
uint32_t spi0_tx_buffer;

uint16_t lcd_width = 239;
uint16_t lcd_height = 319;
#else
extern volatile const uint32_t col_addr_set;
extern volatile const uint32_t page_addr_set;
extern volatile const uint32_t mem_write;
extern volatile const uint32_t set_brightness_cmd;
extern volatile uint8_t* const data;	//sets NCS0 HIGH for data
extern volatile uint8_t* const command; //sets NCS0 LOW for cmd
extern volatile uint16_t lcd_height;
extern volatile uint16_t lcd_width;
extern volatile bool two_byte_per_pix_mode;
extern volatile const uint16_t tft_debug_newline_height;	//amount of rows to scroll for a new line when debugging
extern volatile uint16_t tft_vscroll_val;
extern volatile char tft_debug_buff[17];
#endif



/*
IMPORTANT NOTES:
Apparently the DMAC's max BTZISE is 4095 https://arduino.stackexchange.com/questions/19615/due-dmac-btsize-trimmed-modulo-8192
Also, for linked lists to work, either SADDR or DADDR need to be fetched
It makes sense that DADDR is fetched, because it's always constant
*/

inline void smc_tft_lcd_init_pins() {
	pio_disable_pullup(PIOA, PIN_A4A | PIN_4A);	//NCS0 and NRD
	pio_enable_output(PIOA, PIN_A4A | PIN_4A);
	pio_disable_pio(PIOA, PIN_A4A | PIN_4A);
	pio_set_periph_mode_B(PIOA, PIN_A4A | PIN_4A);
	//D[7:0] (pins 34-41) and NWE (pin45) (write enable)
#ifdef SAM_16_BIT_LCD_SMC
	pio_disable_pullup(PIOC, 0x3fffc | PIN_45C);
	pio_enable_output(PIOC, 0x3fffc | PIN_45C);
	pio_disable_pio(PIOC, 0x3fffc | PIN_45C);
	pio_set_periph_mode_A(PIOC, 0x3fffc | PIN_45C);
#else
	pio_disable_pullup(PIOC, PIN_34C | PIN_35C | PIN_36C | PIN_37C | PIN_38C | PIN_39C | PIN_40C | PIN_41C | PIN_45C);
	pio_enable_output(PIOC, PIN_34C | PIN_35C | PIN_36C | PIN_37C | PIN_38C | PIN_39C | PIN_40C | PIN_41C | PIN_45C);
	pio_disable_pio(PIOC, PIN_34C | PIN_35C | PIN_36C | PIN_37C | PIN_38C | PIN_39C | PIN_40C | PIN_41C | PIN_45C);
	pio_set_periph_mode_A(PIOC, PIN_34C | PIN_35C | PIN_36C | PIN_37C | PIN_38C | PIN_39C | PIN_40C | PIN_41C | PIN_45C);
#endif
}

inline void smc_tft_lcd_setup() {
#ifdef SAM_16_BIT_LCD_SMC
	REG_SMC_MODE0 = 1 | (1 << 1) | (1 << 8) | (1 << 12);
	REG_SMC_MODE1 = 1 | (1 << 1) | (1 << 8) | (1 << 12);

	// SETUP: Put data on the bus, then wait 2 clocks (24ns) for ringing to settle
	REG_SMC_SETUP0 = 2 | (2 << 8) | (2 << 16) | (2 << 24);
	REG_SMC_SETUP1 = 2 | (2 << 8) | (2 << 16) | (2 << 24);

	// PULSE: Drop the WR strobe for 4 clocks (48ns) to lock in the clean data
	REG_SMC_PULSE0 = 4 | (4 << 8) | (4 << 16) | (4 << 24);
	REG_SMC_PULSE1 = 4 | (4 << 8) | (4 << 16) | (4 << 24);

	// CYCLE: Total cycle is 8 clocks. This leaves 2 clocks of HOLD time at the end!
	REG_SMC_CYCLE0 = 8 | (8 << 16);
	REG_SMC_CYCLE1 = 8 | (8 << 16);
#else
	REG_SMC_MODE0 = (1 << 1);
	REG_SMC_PULSE0 = 1 | (1 << 8);
	REG_SMC_CYCLE0 = 2;

	// SMC1 - data, read/write
	REG_SMC_MODE1 = 1 | (1 << 1);
	REG_SMC_PULSE1 = 1 | (1 << 8) | (15 << 16) | (15 << 24);
	REG_SMC_CYCLE1 = 2 | (30 << 16);
#endif
}

inline void lcd_set_columns(uint16_t start, uint16_t end) {
	//This sends 1 byte to specify command and 4 bytes of data (2 for start, 2 for end)
	*command = col_addr_set;
	*data = (start >> 8);
	*data = start;
	*data = (end >> 8);
	*data = end;
}

//The values for pages goes from 0-319, and anything over 255 is over 1 byte, so this needs 2 bytes
inline void lcd_set_pages(uint16_t start, uint16_t end) {
	*command = page_addr_set;
	*data = (start >> 8);
	*data = start;
	*data = (end >> 8);
	*data = end;
}
inline void lcd_clear() {
	*command = mem_write;
	if(two_byte_per_pix_mode) {
		for (uint32_t i = 0; i < 320*240; ++i) {
#ifdef SAM_16_BIT_LCD_SMC
			*reinterpret_cast<uint16_t*>(data) = 0x00;
#else
			*data = 0x00;
			*data = 0x00;
#endif
		}
		return;
	}
	else {
		for (uint32_t i = 0; i < 320 * 240; ++i) {
			*data = 0x00;
			*data = 0x00;
			*data = 0x00;
		}
	}
}

inline void lcd_fill(uint8_t r, uint8_t g, uint8_t b) {
	*command = mem_write;
	if(two_byte_per_pix_mode) {
		for (uint32_t i = 0; i < 76800; ++i) {
			*data = (g & 0b11100000) | (r >> 3);
			*data = b >> 3 | (g << 3);
		}
		return;
	}
	else {
		for (uint32_t i = 0; i < 76800; ++i) {
			*data = b;
			*data = g;
			*data = r;
		}
	}
}

inline void tft_display_off() { *command = 0x28; }
inline void tft_display_on() {
	*command = 0x29;
	delayMicros(5000);
}

inline void init_lcd_smc_dma() {
	//all of the settings are set with the linked lists so this function isnt really necessary i guess
	REG_DMAC_EN = 1;
}

//My TFT's MADCTL B4 = 0
/*
	enables the periph clocks
	sets up the SMC pins
	starts the display and clears it
	should be good to go after this
*/
inline void init_tft(bool horizontal = false, bool two_byte_per_pix = false) {
	pmc_enable_periph_clk(ID_SMC);
	pmc_enable_periph_clk(ID_DMAC);
	smc_tft_lcd_setup();
	smc_tft_lcd_init_pins();
	*command = 0x01;	//software reset, which doesn't really do anything
	delayMicros(5000);
	*command = 0x11;	//sleep out
	delayMicros(5000);
	if (horizontal) {
		*command = 0x36; //madctl access
		*data = (0b101 << 5); //flip x and y, and mirror y
		lcd_set_columns(0, 319);
		lcd_set_pages(0, 239);
	}
	else {
		lcd_set_columns(0, 239);
		lcd_set_pages(0, 319);
	}
	if(two_byte_per_pix) {
		*command = 0x3A;
		*data = 0x55; //16 bits per pixel
		two_byte_per_pix_mode = true;
	}
	delayMicros(1000);
	//refresh rate, default is 70hz
	//*command = 0xb1;
	//*data = 0x00;
	//*data = 0x10;	//~119Hz refresh rate
	//*data = 0x13;	//~100Hz
	//*data = 0x15;	//~90Hz
	//*data = 0x1f; //~61Hz
	init_lcd_smc_dma();
	lcd_clear();
	tft_display_on();
}

