fishinginaswamp/duelibs/SAM3XDUE/SAM3XDUE.H
inline void dmac_wait_for_done() { while (REG_DMAC_CHSR & 0b11) {} }

inline void tft_vscroll_def(uint16_t tfa = 0, uint16_t vsa = 320, uint16_t bfa = 0) {
	/*
	The default args set the entire screen up for scrolling
	TFA - Top fixed area - number of rows from the top that shouldn't be affected by the scroll
	VSA - Vertical scroll area - how many rows will be scrolled
	BFA - Bottom fixed area - rows at the bottom that won't be affected by the scroll
	NOTE: Behavior is only defined if TFA + VSA + BFA = 320
	*/
	*command = 0x33; //vertical scrolling definition
	*data = tfa >> 8;
	*data = tfa;
	*data = vsa >> 8;
	*data = vsa;
	*data = bfa >> 8;
	*data = bfa;
}

inline void tft_partial_mode() {
	/*Turns on partial mode
	NOTE: set the partial area before turing on partial mode
	*/
	*command = 0x12;
}

inline void tft_partial_area(uint16_t start_row, uint16_t end_row) {
	/*
	start row - what row number to start at
	end row - what row number to end at
	If start row < end row, it'll behave as expected (partial area is subsection of display)
	if start row > end row (end row is above start row) then the partial area will wrap around
	if start row == end row, then the partial area is one row
	*/
	*command = 0x30;
	*data = start_row >> 8;
	*data = start_row;
	*data = end_row >> 8;
	*data = end_row;
}

inline void tft_normal_mode() {
	/*Turns partial mode off
	NOTE: To turn off partial mode:
		1. Turn display OFF
		2. Turn on normal mode (turn off partial mode)
		3. Clear display (part of display RAM could be garbage)
		4. Turn display ON
	*/
	tft_display_off();
	*command = 0x13;
	lcd_clear();
	tft_display_on();
}

inline void tft_vscroll(uint16_t lines) {
	/*
	THE SCREEN SCROLLS UP
	The number of lines to v_scroll is fixed/relative to 0:
		v_scroll(10) then v_scroll(13) only scrolls 3 row, NOT 23
		use v_scroll(0) to return display to normal
	*/
	*command = 0x37;
	*data = lines >> 8;
	*data = lines;
}

inline void tft_debugger_init() {
	init_tft();
	tft_debug_buff[16] = '\n';
	tft_vscroll_def();
	lcd_set_columns(0, 239);
	lcd_set_pages(0, 319);
}

/*
inline void tft_debug_letters_test() {
	uint16_t s_col = 2;
	uint16_t e_col = 8;
	uint16_t s_pages = 2;
	lcd_set_pages(s_pages, 319);
	s_pages = 311;
	for (uint8_t k = 0; k < 4; ++k) {
		for (uint8_t i = 0; i < 26; ++i) {
			const uint8_t* l_ptr = d_letters[i];
			lcd_set_columns(s_col, e_col);
			s_col += 7;
			e_col += 7;
			*command = mem_write;
			for (uint8_t j = 0; j < d_size; ++j) {
				*data = color_palette[l_ptr[j]][0];
				*data = color_palette[l_ptr[j]][1];
				*data = color_palette[l_ptr[j]][2];
			}
		}
		s_col = 2;
		e_col = 8;
		tft_vscroll_val += tft_debug_newline_height;
		tft_vscroll_val %= 320;
		tft_vscroll(tft_vscroll_val);
		s_pages -= 8;
		lcd_set_pages(s_pages, 319);
		delayMicros(0xFFFF);
	}
	while (1) {}
}
*/


/*
Using chip select 0 on digital pin 10
Calculation for SPI0 clk freq is: clk_freq = MCLK/BAUD_DIV
ex: 84MHz / 8 = 10.5MHz SPI clock freq
16 bits per transfer, data on rising edge
*/
extern volatile uint32_t spi0_rx_buffer;
extern volatile uint32_t spi0_tx_buffer;

inline void spi0_cs_rise_after_tx(bool rise) {
	if (rise)
		REG_SPI0_CSR |= (1 << 2) | (1 << 3);
	else
		REG_SPI0_CSR = REG_SPI0_CSR & ~((1 << 2) | (1 << 3));
}

//spi clock is mck/baud div
//remember to enable the periph clock
inline void spi0_init_master(uint8_t baud_div, uint8_t cs_num = 0) {
	uint32_t cs_pin = (1 << spi0_cs_portA_pins[cs_num]); //to do: make sure this works
	
	pio_enable_output(PIOA, SPI0_MOSI | SPI0_SCK | SPI0_NPCS0);
	pio_disable_output(PIOA, SPI0_MISO);
	pio_disable_pullup(PIOA, SPI0_MOSI | SPI0_MISO | SPI0_SCK | SPI0_NPCS0);
	pio_disable_pio(PIOA, SPI0_MOSI | SPI0_MISO | SPI0_SCK | SPI0_NPCS0);
	pio_set_periph_mode_A(PIOA, SPI0_MOSI | SPI0_MISO | SPI0_SCK | SPI0_NPCS0);
	//8 gives 10.5MHz clock, 9 gives 9.333MHz clock
	//chip select does not rise systematically until a new transfer is requested on a different chip select
	REG_SPI0_CSR = (1 << 1) | (1 << 3) | (0 << 4) | (baud_div << 8); //data on rising edge, 8 bits/xfer
	REG_SPI0_MR = 1 | (1 << 4); //master mode, fixed peripheral select (NPCS0), no decode/fault/delay
	REG_SPI0_CR = 1; //enable spi
}

inline void spi0_set_baud_rate_div(uint8_t baud_div) {
	REG_SPI0_CSR = ((REG_SPI0_CSR & ~0xff00) | (baud_div << 8));
}

inline void spi0_init_gbc_display(uint8_t baud_div = 1) {
	pio_enable_output(PIOA, SPI0_MOSI | SPI0_SCK | SPI0_NPCS0);
	pio_disable_output(PIOA, SPI0_MISO);
	pio_disable_pullup(PIOA, SPI0_MOSI | SPI0_MISO | SPI0_SCK | SPI0_NPCS0);
	pio_disable_pio(PIOA, SPI0_MOSI | SPI0_MISO | SPI0_SCK | SPI0_NPCS0);
	pio_set_periph_mode_A(PIOA, SPI0_MOSI | SPI0_MISO | SPI0_SCK | SPI0_NPCS0);
	//max baud rate because our display can ball
	//DC - HIGH = DATA, LOW = COMMAND
	//CS0 for command, CS1 for data
	//Reset - pull low to reset
	//CS - Active low - tied to ground
	REG_SPI0_CSR = (1 << 1) | (1 << 3) | (baud_div << 8); //data on rising edge, 8 bits/xfer
	//I'm writing to SPI0_CSR1 myself
	*((uint32_t*)0x40008034) = (1 << 1) | (1 << 3) | (baud_div << 8);
	REG_SPI0_MR = 1 | (1 << 1) | (1 << 4); //master mode, variable peripheral select (CS0, 1), no decode/fault/delay
	REG_SPI0_CR = 1; //enable spi

}

//Using DMAC channel 0 - 8 byte FIFO
//CTRLB needs to be programmed, and A needs to be tweaked
inline void spi0_init_master_dmac(uint8_t dmac_channel_number = 0) {
	//SPI0 TX interface number is 1
	REG_DMAC_EBCIDR = ~0;
	REG_DMAC_CHDR = ~0;
	REG_DMAC_CTRLA0 = (1 << 25) | (1 << 29);
	REG_DMAC_DADDR0 = 0x4000800CU;
	REG_DMAC_CFG0 = (1 << 4) | (1 << 13);
	//REG_DMAC_EN |= 1;
}

inline void spi0_set_variable_cs(bool enable) {
	uint32_t SPI_MR = REG_SPI0_MR;
	if (enable) {
		SPI_MR |= (1 << 1);
	}
	else {
		SPI_MR &= ~(1 << 1);
	}
	REG_SPI0_MR = SPI_MR;
}

inline void spi0_init_slave(uint8_t baud_div) {
	pio_enable_output(PIOA, SPI0_MISO);
	pio_disable_output(PIOA, SPI0_MOSI | SPI0_NSS);
	pio_disable_pullup(PIOA, SPI0_MOSI | SPI0_MISO | SPI0_SCK | SPI0_NSS);
	pio_disable_pio(PIOA, SPI0_MOSI | SPI0_MISO | SPI0_SCK | SPI0_NSS);
	pio_set_periph_mode_A(PIOA, SPI0_MOSI | SPI0_MISO | SPI0_SCK | SPI0_NSS);
	//8 gives 10.5MHz clock, 9 gives 9.333MHz clock
	REG_SPI0_CSR = (1 << 1) | (1 << 2) | (1 << 3) | (baud_div << 8); //data on rising edge, 16 bits/xfer
	REG_SPI0_MR = (1 << 4); //slave mode, fixed peripheral select (NPCS0), no decode/fault/delay
	REG_SPI0_CR = 1; //enable spi
}

//Using DMAC channel 1 - 8 byte FIFO
//CTRLB needs to be programmed, and A needs to be tweaked
inline void spi0_init_slave_dmac() {
	//SPI0 RX interface number is 2
	REG_DMAC_EBCIDR |= (1 << 1) | (1 << 9) | (1 << 17);
	REG_DMAC_CHDR |= (1 << 1);
	//REG_DMAC_CTRLA1 = 1 | (1 << 25);
	REG_DMAC_SADDR1 = 0x40008008U;
	REG_DMAC_CFG1 = (1 << 1) | (1 << 9);
	REG_DMAC_EN |= 1;
}

inline void spi0_npcs0_enable_manual_control(bool en = true) {
	if (en) {
		pmc_enable_periph_clk(ID_PIOA);
		pio_disable_pullup(PIOA, SPI0_NPCS0);
		pio_enable_output(PIOA, SPI0_NPCS0);
		pio_enable_pio(PIOA, SPI0_NPCS0);
	}
	else {
		pio_disable_pio(PIOA, SPI0_NPCS0);
		pio_set_periph_mode_A(PIOA, SPI0_NPCS0);
		pio_enable_output(PIOA, SPI0_NPCS0);
		pio_disable_pullup(PIOA, SPI0_NPCS0);
	}
}


inline void spi0_npcs0_low() {
	pio_output_write_LOW(PIOA, SPI0_NPCS0);
}

