fishinginaswamp/duelibs/SAM3XDUE/SAM3XDUE.H
inline void spi0_npcs0_high() {
	pio_output_write_HIGH(PIOA, SPI0_NPCS0);
}

//this can be used to write to SPI1,2... (the different chip selects)
//this used to be for only SPI0 and I don't want to break anything by renaming it
inline void spi0_write_tx_xfer(uint16_t data) {
	REG_SPI0_TDR = data;
}

//same as the function above, but for... variable chip select
inline void spi_variable_cs_write_tx_xfer(uint16_t data, uint8_t pcs) {
	REG_SPI0_TDR = data | ((pcs & 0xf) << 16);
}

//this only works if variable chip select is active, default to CS0 for SPI0
inline void spi0_write_last_tx_xfer(uint16_t data, uint8_t pcs = 0) {
	REG_SPI0_TDR = data | ((pcs & 0xf) << 16) | (1 << 24);
}

inline void spi0_wait_tx_xfer() {
	//Pauses while the data in the transmit register has not been sent to serializer
	while (!(REG_SPI0_SR & (1 << 9))) {}
}

inline void spi0_wait_rx_xfer() {
	//Pauses while data has not been received in the RDR since last time it was read
	while (!(REG_SPI0_SR & 1)) {}
}

extern uint32_t led_matrix_buff0[16];
extern uint8_t crnt_digit;
extern uint8_t matrix_prev_digit;

inline void update_dot(uint32_t current_data) {
	//x has offset 16
	//y has offset 24
	uint8_t x = static_cast<int8_t>(__RBIT((current_data >> 16) & 0xFF)) + 128; //digit
	uint8_t y = static_cast<int8_t>(__RBIT((current_data >> 24) & 0xFF)) + 128; //segment
	x >>= 5; //get number between 0 and 8
	y >>= 5;
	led_matrix_buff0[matrix_prev_digit] &= 0xFF00;
	led_matrix_buff0[x] |= (1 << y);
	matrix_prev_digit = x;
}

inline void scroll_dot() {
	uint8_t dot = led_matrix_buff0[crnt_digit] & 0xFF;
	dot <<= 1;
	if (!dot) {
		led_matrix_buff0[crnt_digit] &= 0xFFFFFF00;
		++crnt_digit;
		if (crnt_digit > 15)
			crnt_digit = 0;
		led_matrix_buff0[crnt_digit] |= 1;
	}
	else
		led_matrix_buff0[crnt_digit] = (led_matrix_buff0[crnt_digit] & 0xFFFFFF00) | dot;
}


inline void led_matrix_spi0_dma_init() {
	//using DMAC channel 2
	//SPI0 TX has DMA channel HW Interface number 1
	REG_DMAC_CHDR |= 1 << 2;
	REG_DMAC_SADDR2 = (uint32_t)led_matrix_buff0;
	REG_DMAC_DADDR2 = 0x4000800CU;
	REG_DMAC_CTRLA2 = 16 | (1 << 25) | (1 << 29);
	REG_DMAC_CTRLB2 = (1 << 16) | (1 << 20) | (1 << 21) | (0b10 << 28);
	REG_DMAC_CFG2 = (1 << 4) | (1 << 13);
	REG_DMAC_EN = 1;
}

inline void led_matrix_start_dma() {
	REG_DMAC_SADDR2 = (uint32_t)led_matrix_buff0;
	REG_DMAC_CTRLA2 = 16 | (1 << 25) | (1 << 29);
	REG_DMAC_CHER |= (1 << 2);
}

inline void led_matrix_wait_dmac() {
	while (REG_DMAC_CHSR & (1 << 2)) {}
}

inline void led_matrix_shutdown_mode(uint8_t mode = 1) {
	//0 - shutdown
	//1 - normal operation
	spi0_write_tx_xfer((0b1100 << 8) | mode);
	delayMicros(2);
	spi0_write_tx_xfer((1 << 16) | (0b1100 << 8) | mode);
	delayMicros(2);

}

inline void led_matrix_decode_mode(uint8_t decode = 0) {
	spi0_write_tx_xfer((0b1001 << 8) | decode);
	delayMicros(2);
	spi0_write_tx_xfer((1 << 16) | (0b1001 << 8) | decode);
	delayMicros(2);
}

inline void led_matrix_intensity(uint8_t intensity) {
	//only the 4 LSB matter
	//at 0, LED duty cycle is 1/32
	//every increase of 1 to intensity raises duty cycle by 2/32
	//(Every odd duty cycle between 1/32 and 31/32 inclusive)
	spi0_write_tx_xfer((0b1010 << 8) | intensity);
	delayMicros(2);
	spi0_write_tx_xfer((1 << 16) | (0b1010 << 8) | intensity);
	delayMicros(2);
}

inline void led_matrix_scan_limit(uint8_t limit = 7) {
	//0b000 - 0b111 (0-7) which segments to light up
	//The matrix needs all of them, preferably 
	spi0_write_tx_xfer((0b1011 << 8) | limit);
	delayMicros(2);
	spi0_write_tx_xfer((1 << 16) | (0b1011 << 8) | limit);
	delayMicros(2);
}

inline void led_matrix_test_mode(uint8_t mode = 0) {
	spi0_write_tx_xfer((0b1111 << 8) | mode);
	delayMicros(2);
	spi0_write_tx_xfer((1 << 16) | (0b1111 << 8) | mode);
	delayMicros(2);
}

inline void led_matrix_spi0_init(uint8_t baud_div, uint8_t intensity, uint8_t scan_limit = 7) {
	spi0_init_master(baud_div);
	led_matrix_test_mode(1);
	led_matrix_test_mode(0);
	led_matrix_intensity(intensity);
	led_matrix_decode_mode(0);
	led_matrix_scan_limit(scan_limit);
	led_matrix_shutdown_mode();
	for (uint8_t i = 1; i <= 8; ++i) {
		spi0_write_tx_xfer((i << 8) | 0);
		delayMicros(2);
	}

	for (uint8_t i = 1; i <= 8; ++i) {
		spi0_write_tx_xfer((1 << 16) | (i << 8) | 0);
		delayMicros(2);
	}

}

#endif